sysbench_debug.log
sysbench 1.0.20 (using system LuaJIT 2.1.1720049189)

Running the test with following options:
Number of threads: 30
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2332705
        write:                           0
        other:                           0
        total:                           2332705
    transactions:                        2332705 (7774.95 per sec.)
    queries:                             2332705 (7774.95 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0262s
    total number of events:              2332705

Latency (ms):
         min:                                    0.19
         avg:                                    3.85
         max:                                 4361.23
         95th percentile:                        7.17
         sum:                              8991500.75

Threads fairness:
    events (avg/stddev):           77756.8333/12140.43
    execution time (avg/stddev):   299.7167/0.05

sysbench 1.0.20 (using system LuaJIT 2.1.1720049189)

Running the test with following options:
Number of threads: 100
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2492924
        write:                           0
        other:                           0
        total:                           2492924
    transactions:                        2492924 (8306.95 per sec.)
    queries:                             2492924 (8306.95 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0985s
    total number of events:              2492924

Latency (ms):
         min:                                    0.34
         avg:                                   12.03
         max:                                14882.95
         95th percentile:                       19.65
         sum:                             29991884.17

Threads fairness:
    events (avg/stddev):           24929.2400/2839.73
    execution time (avg/stddev):   299.9188/0.02